// 주석 입력
/*
다중 주석 입력
*/

// 1. HTML 문서 내 출력
document.write('HTML 문서 내 출력');
document.write('<h1 id=idTag>h1태그로 출력</h1>');
document.write('<h2>');
document.write('h2태그로 출력');
document.write('</h2>');

// 2. console창 출력
// log-> ㅁlog 클릭 해서 자동완성 사용하면 편함
// 개발자도구(오른쪽 마우스 > 검사 또는 F12) > 콘솔
console.log('console창 출력');
console.log('log 자동완성');

// 3. 알림 팝업창 출력
alert('군순님 내일부터 금연 🚭')

/* 
대소문자 구분하여 작성
코드 한 줄을 작성한 후에는 세미콜론(;)을 쓰는 것이 좋음 -> 코드가 끝났다는 표시
큰따옴표("")와 작은 따옴표('')의 겹침 오류를 주의해야합니다
ex ) ("Hello World!') // error
ex) 안쪽에 ' 가 들어간다면 -> " " 로 묶어 줘야함 -> ("I'm fine") // I'm fine
*/

